{
    "switch_lang":"Fr",
    "home_page":"Home",
    "crc_robotics":"CRC Robotics",
    "team":"Our Team",
    "conception":"Conception",
    "comp_progress":"Component Progress",
    "credits":"Credits",
    "rules":"Rules",
    "settings":"Settings",


    "robot":"Robot",
    "kiosk":"Kiosk",
    "video":"Video",
    "coding":"Coding",
    "website":"Website",
    "mentors":"Mentors",
    "entire":"The Entire Team",


    "back_button": "Back",
    
    "task":"What Did I do? :",
    "fun_fact":"Fun Fact :",
    
    "kiosk_coe":"Co-Captain of Kiosk ",
    "kiosk_co":"Co-Captain of Kiosk",
    "robot_co":"Co-Captain of Robot",
    
    "kiosk_video":"Kiosk & Video",
    "robot_video":"Robot & Video",
    "robot_kiosk":"Robot & Kiosk",
    "video_tutorial":"Video & Tutorial",
    "website_video":"Website & Video",
    "robot_kiosk_website":"Robot, Kiosk & Website",



    "gab_desc":"I did a programming class 4 times a week where Tommi and I taught Christian, George and Vassili.",
    "gab_fact":"Not only is good food a perk of being latino, but I can also put myself as mexican batman in the website(not cultural appropriation if you're latino!)",

    "zoe_desc":"I worked on kiosk and played Harley Quinn in the video.",
    "zoe_fact":"Best hot chocolate maker.",

    "julian_desc":"I worked solely on the construction of the kiosk; working on both the design and building aspects and guided my team through challenges.",
    "julian_fact":"I am incredibly extroverted and im always looking for a conversation. I also will probably be the most musically enthusiastic person you'll meet.",

    "lucas_desc":"I worked on the Batmobile.",
    "lucas_fact":"I like Basketball and Hockey.",

    "andy_desc":"I worked on the car (Batmobile).",

    "brody_desc":"I contributed in making the Batman statue as well as helped with the video.",
    "brody_fact":"Gymrat.",

    "arthur_desc":"I helped the kiosk by building the Batmobile.",

    "bella_desc":"I am the co-captain of the kiosk team, and I worked on the walls this year.",
    "bella_fact":"A little procrastination is key to creating an amazing kiosk.",

    "david_desc":"I worked on the kiosk.",
    "david_fact":"I like food.",

    "cynthia_desc":"I helped build the Batmobile.",

    "chase_desc":"I am a jack of all trades. I do a little bit of everything!",
    "chase_fact":"Devin is my Friend.",

    "melissa_desc":"I helped paint the walls.",

    "zachdeluc_desc":"I worked on the kiosk.",
    "zachdeluc_fact":"I've brought peace, freedom, justice and security to my new empire !",

    "marcus_desc":"I helped sketch the kiosk, helped cut wood for the car and helped assemble the chains for the robot.",

    "daniel_desc":"I contributed to the kiosk.",
    "daniel_fact":"I can joke around.",

    "charlie_desc":"I acted in the video by being Batman and assisted in the construction of the robot.",
    "charlie_fact":"I'm batman.",

    "mia_desc":"I helped with the kiosk by building a Batman themed pinball machine as well as helped with the video.",

    "naman_desc":"I worked on the kiosk with other secondary 1's and 2's.",
    "naman_fact":"I'm way more productive when I'm supposed to be doing something else.",

    "zachvam_desc":"I worked on the front of the Batmobile.",
    "zachvam_fact":"I like to watch The Big Bang Theory!",

    "william_desc":"Worked on the Batman themed kiosk.",

    "george_desc":"I was part of the programming class.",
    "george_fact":"AI has nothing on me when it comes to coding.",

    "dany_desc":"I worked in the kiosk and the Batmobile, also did electrical circuitry.",
    "dany_fact":"I like eating cause it's fun.",

    "christian_desc":"I'm going to be in the programming competition!",
    "christian_fact":"I'm double jointed on my thumbs so I can't use scissors.",

    "raphael_desc":"Cut wood, built the batman car and stuck the LED lights on the front of the car.",

    "jonah_desc":"Worked on kiosk (Batman statue) and helped with video.",
    "jonah_fact":"Batman doesn't need a GPS - he always takes the Dark Knight route 🦇😄 - ChatGPT 2026",

    "box_desc":"I worked on the kiosk by managing the wood.",
    "box_fact":"LIGHT WEIGHT!!",

    "mack_desc":"I helped the kiosk team with the building (here and there).",
    "mack_fact":"I CANNOT do the irish jig.",

    "nicolas_desc":"I acted as the Joker in the video and I helped with the tutorial.",
    "nicolas_fact":"I happily painted my hair green as well as did whiteface.",

    "goal":"Goal of The Game:",
    "scoring":"Score the most points by handling and placing the following engine components that will be on the playing field: fans, cores, and turbines. These components are placed into engines.",
    "game_rules2":"Comic:",
    "rule1":"Before the game...",
    "rule2":"Blue team vs yellow team: 2 robots on each team. 5 minutes per heat.",
    "rule3":"Each engine component can come in blue, yellow, or red. Each team uses the parts specific to their team color.",
    "rule4":"6 engines, each can be completed with one fan, one core, one turbine.",
    "rule5":"Robots can only carry one component at a time. Cannot carry the other team's color: only their team's color and the red ones.",
    "rule6":"Red parts: unserviceable",
    "rule7":"If the component that falls out of an engine is a red part, it can be repaired in the repair station. Each team has three repair stations that can turn red parts into repaired parts of their color.",
    "rule8":"Spare parts lying around can be brought to the spare parts zone. Each team has one.",
    "rule9":"Scoring...",
    "rule10":"1 of your color component gives 50 points, 2 give 100 points and 3 give 250 points.",
    "rule11":"Multipliers...",
    "rule12":"Tallest stack of the two teams in their spare parts zone brings a 60% multiplier.",
    "rule13":"Team with most pieces in their spare parts zone earns a 40% multiplier",
    "rule14":"One team can get both bonuses.",
    "rule15":"Every repair earns 30 points.",
    "rule16":"Each component in the spare parts zone is worth 40 points.",
    "rule17":"The End.",

    "componentprog": "Component Progress",
    "viewtime": "View Timeline",
    "braintitle": "First concrete idea/iteration of the robot design featuring :",
    "braindesc": "3D printer style lift and game piece manipulation system at front, bevel gear meccanum wheel drive powered by Goblilda yellow jackets, ramp and back end slotting compartment molded to the game engines.",
    "findesign": "Finalized Design",
    "process":"Process",
    "frametitle":"Frame",
    "framedesc":"Build the frame of the robot, finalize dimensions and main chassis bracing",
    "convtitle":"Conveyor",
    "convdesc":"Build / Design the conveyor systems distinct to each GP",
    "drivetitle":"Drive",
    "drivedesc":"Build the drive system, build bracing and connected bearings / gears, Changed from tread drive to RWD independent drive sys.",
    "roadblocks":"Roadblocks",
    "roadblock1":"Roadblock 1",
    "roadblock2":"Roadblock 2",
    "roadblock3":"Roadblock 3",
    "rb1":"Our first obstacle was making all systems as such so that the total footprint fits the dimension limit of the robot on top of leaving enough space for the GP conveyors since we designed the robot to go over the Engine.",
    "rb2":"Our first obstacle continues. The next obstacle was that the tread was so fragile and susceptible to shearing so we had to change the drive system as whole, only keeping the same bracing.",
    "rb3":"The final obstacle was finding the precise positioning for the lift perfect optimal counter balancing due to our slightly shortened wheel base and back heavy components.",
    "clawtitle":"Claw",
    "clawdesc":"Design claw and build the claw lift system, CAD the sprockets for the chain-pulley system, calculate increased moment of inertia and build lift",
    "lefttitle":"Complete electronics of the robot",
    "leftdesc":"Optimize electronic’s positioning, cable managing",
    "righttitle":"Testing",
    "rightdesc":"Testing the robot and all of its components in our practice field, with engines and Game Pieces, making sure that all systems are functional and stress test each part",
    
    "toggle_full":"Toggle Fullscreen",
    "toggle_scan":"Toggle Scanline Effect",

    "visit_source":"Visit source",
    "credit1":"Folder image",
    "credit2":"Glitch effect",
    "credit3":"Batcomputer logo",
    "credit4":"Batcomputer HUD wallpaper",
    "credit5":"Scanlines",
    "credit6":"Transition glitch effect",
    "credit7":"Comic book strip effect",
    "credit8":"Batman comic strip images",

    "about_crc":" What is CRC Robotics?",
    "about_crctext":"CRC Robotics Competition is a non-profit organization founded in 2001 that successfully established a way to link engineering, coding, art, mathematics, and more into one competition. In recent years, they have also added a junior division, making robotics more accessible to younger participants.",
    "beyond_competition":"Beyond Competition",
    "beyond_competitiontext":"Beyond the competitive aspect, CRC places strong emphasis on having their competition improve contestants’ teamwork, building meaningful connections, and providing resources necessary to develop their knowledge in STEM.",
    "crc_more":"To learn more about the competition, you can visit their website below:",
    
    "conception_title1":"Game Piece Conveyor System",
    "conception_title2":"Electronics",
    "conception_title3":"Claw Lift / Game Piece Stacking Lift",
    "conception_title4":"Drive System",
    "conception1":"Game piece conveyor system is made up of 3 distinct levels for each size of GP. Proportions and alignment are exactly molded to match the entrance of the Engines for extreme ease and efficiency when playing the game. Each conveyor system funnels game pieces from the playing field, as they stand, into the desired channel to match the Engine, allowing for undemanding and simple manipulation of the GP's and the Engines together when ejected from the back side of the robot. Both the chain system (sprocket, chain, dividers) and their bearing brackets are fully custom designed.",
    "conception2":"All electronics are securely mounted onto the top frame of the robot, distributed for easy access and efficiency, also providing clear accessibility to the kill switch and Crcduino. The battery is placed on the front end of the robot frame to counter weight the components - such as the 3 motor setup for the distinct conveyors - it also balances the robot's side where the wheelbase is slightly shortened for maneuverability over the engines.",
    "conception3":"Claw lift and rotating mechanism are placed at the front end of the robot at a precise position to pick up the 'core' GP through our conveyor system for maximum potential when stacking (since the 'core' is the tallest vertically placeable GP - the mechanism also acting as counterweight. The mechanism is made up of 2 large pulleys/chains, positioned for maximum moment of inertia for increased torque; This allows the claw to be rotated at a high precision while being able to carry the heaviest of game pieces.",
    "conception4":"The drive system is RWD made up of 8 distinct wheels. The front 4 wheels (2 each side sandwich) are mounted on 2 bearings and heavily braced Vex metal, a sprocket is connected in between both thin but resistant wheels for a seamless chain driven drive. The back 4 dead wheels (2 each side sandwich) are independent from each other despite being on the same shaft due to specially placed bearings, making it incredibly smooth to turn even with 2 powered wheels out of 4. The system is powered by two, 117rpm GoBilda motors for a balance of speed and torque. As a whole the drive has a very small footprint to give the robot an elite advantage when playing on the Engines.",
    
    
    "charliemo_desc": "I worked on the kiosk, attached one of the Batmobile wings, did LED soldering, worked on the Batmobile, and made the LED holder shaped like a circle.",
    "charliemo_fact": "I like bagels",

    "kamrynhum_desc": "Worked on the kiosk.",
    "kamrynhum_fact": ".",

    "euniceliang_desc": "Worked on the kiosk (mainly the Batman figure) and the video.",
    "euniceliang_fact": "I need to fix my sleep schedule.",

    "tommisabra_desc": "Taught programming for the competition.",
    "tommisabra_fact": "N/A",

    "adihverma_desc": "I designed and built the robot, as well as wrote the content for the website.",
    "adihverma_fact": "Add me on Fortnite 🤪: Gamer007ny",

    "zacharystewart_desc": "I constructed the robot and CADed its parts.",
    "zacharystewart_fact": "N/A",

    "alanamangione_desc": "I acted in the video and helped with the website.",
    "alanamangione_fact": "I don't know anything about coding. This is awkward.",

    "sofiamazareanu_desc": "I directed the video and wrote the script for it.",
    "sofiamazareanu_fact": "I like the colour blue."


} 
