{
    "switch_lang":"En",
    "home_page":"Accueil",
    "crc_robotics":"CRC Robotique",
    "team":"Notre Équipe",
    "conception":"Conception",
    "comp_progress":"Progression des Composants",
    "credits":"Crédits",
    "rules":"Règles Du Jeu",
    "settings":"Paramètres",


    "robot":"Robot",
    "kiosk":"Kiosque",
    "video":"Vidéo",
    "coding":"Codage",
    "website":"Site web",
    "mentors":"Mentors",
    "entire":"L'équipe entière",

    "back_button": "Retour",

    "task":"Quelle est ma contribution? :",
    "fun_fact":"Fait intéressant :",
     
    "kiosk_coe":"Co-capitaine de la division Kiosque",
    "kiosk_co":"Co-capitain de la division Kiosque",
    "robot_co":"Co-capitain de la division Robot",

    "kiosk_video":"Kiosque & Vidéo",
    "robot_video":"Robot & Vidéo",
    "robot_kiosk":"Robot & Kiosque",
    "video_tutorial":"Vidéo & Tutoriel",

    "gab_desc":"J'ai fait un cours de programmation quatre fois par semaine où Tommi et moi avons enseigné à Christian, George et Vassili.",
    "gab_fact":"Non seulement la bonne nourriture est un avantage d'être latino, mais je peux aussi me définir comme Batman mexicain dans le site web(ce n'est pas de l'appropriation culturelle si tu es latino !)",

    "zoe_desc":"J'ai travaillé sur le kiosque et j'ai pris le rôle de Harley Quinn dans la vidéo.",
    "zoe_fact":"Je suis la meilleure préparatrice de chocolat chaud",

    "julian_desc":"J'ai travaillé uniquement sur la construction du kiosque, en m'occupant à la fois du design et de l'assemblage, et j'ai guidé mon équipe à travers les défis.",
    "julian_fact":"Je suis extrêmement extraverti et je suis toujours partant pour une conversation. Je serai aussi probablement la personne la plus enthousiaste musicalement que tu rencontreras.",

    "lucas_desc":"J'ai travaillé sur la Batmobile.",
    "lucas_fact":"J'aime le Basketball et le Hockey.",

    "andy_desc":"J'ai travaillé sur la voiture (Batmobile).",

    "brody_desc":"J'ai contribué à la fabrication de la statue de Batman et j'ai aussi aidé avec la vidéo.",
    "brody_fact":"Accro au gym.",

    "arthur_desc":"J'ai aidé le kiosque en construisant la Batmobile.",

    "bella_desc":"Je suis la co-capitaine de l'équipe du kiosque et j'ai travaillé sur les murs cette année.",
    "bella_fact":"Un peu de procrastination est la clé pour créer un kiosque incroyable.",

    "david_desc":"J'ai travaillé sur le kiosque.",
    "david_fact":"J'aime la nourriture.",

    "cynthia_desc":"J'ai aidé à construire la Batmobile",

    "chase_desc":"Je suis un touche-à-tout. Je fais un peu de tout !",
    "chase_fact":"Devin est mon ami.",

    "melissa_desc":"J'ai aidé à peindre les murs",

    "zachdeluc_desc":"J'ai travaillé sur le kiosque",
    "zachdeluc_fact":"J'ai apporté la paix, la liberté, la justice et la sécurité à mon nouvel empire !",

    "marcus_desc":"J'ai aidé à esquisser le kiosque, à couper le bois pour la voiture et à assembler les chaînes pour le robot.",

    "daniel_desc":"J'ai contribué au kiosque",
    "daniel_fact":"Je sais blaguer.",

    "charlie_desc":"J'ai joué dans la vidéo en incarnant Batman et j'ai aidé à la construction du robot.",
    "charlie_fact":"Je suis Batman.",

    "mia_desc":"J'ai aidé au kiosque en construisant une machine de pinball sur le thème de Batman et j'ai aussi aidé avec la vidéo.",

    "naman_desc":"J'ai travaillé sur le kiosque avec d'autres élèves de secondaire 1 et 2.",
    "naman_fact":"Je suis beaucoup plus productif quand je suis censé faire autre chose.",

    "zachvam_desc":"J'ai travaillé sur l'avant de la Batmobile.",
    "zachvam_fact":"J'aime regarder The Big Bang Theory !",

    "william_desc":"J'ai travaillé sur le kiosque à thème Batman.",

    "george_desc":"Je faisais partie du cours de programmation.",
    "george_fact":"L'IA n'a aucune chance contre moi quand il s'agit de coder.",

    "dany_desc":"J'ai travaillé sur le kiosque et la Batmobile, et j'ai aussi fait du câblage électrique.",
    "dany_fact":"J'aime manger parce que c'est amusant.",

    "christian_desc":"Je vais participer à la compétition de programmation !",
    "christian_fact":"J'ai les pouces hyperlaxes, donc je ne peux pas utiliser de ciseaux.",

    "raphael_desc":"J'ai coupé du bois, construit la voiture Batman et collé les lumières DEL à l'avant de la voiture.",

    "jonah_desc":"J'ai travaillé sur le kiosque (statue de Batman) et aidé avec la vidéo.",
    "jonah_fact":"Batman n'a pas besoin de GPS — il prend toujours la route du Chevalier Noir 🦇😄 - ChatGPT 2026",

    "box_desc":"J'ai travaillé sur le kiosque en gérant le bois.",
    "box_fact":"C'EST PAS LOURD!!",

    "mack_desc":"J'ai aidé l'équipe du kiosque avec la construction (ici et là)",
    "mack_fact":"Je NE SAIS PAS faire la gigue irlandaise.",

    "nicolas_desc":"J'ai incarné le Joker dans la vidéo et j'ai aidé avec le tutoriel.",
    "nicolas_fact":"J'ai peint mes cheveux en vert avec plaisir et j'ai aussi fait du maquillage blanc.",

    "goal":"But du jeu:",
    "scoring":"Marquez le plus de points en manipulant et en plaçant les composants de moteur suivants qui se trouveront sur le terrain de jeu : ventilateurs, cœurs et turbines. Ces composants sont placés dans des moteurs.",
    "game_rules2":"Comic:",
    "rule1":"Avant le jeu...",
    "rule2":"Équipe bleue contre équipe jaune : 2 robots par équipe. 5 minutes par manche.",
    "rule3":"Chaque composant de moteur peut être bleu, jaune ou rouge. Chaque équipe utilise les pièces correspondant à la couleur de son équipe.",
    "rule4":"6 moteurs, chacun peut être complété avec un ventilateur, un cœur et une turbine.",
    "rule5":"Les robots ne peuvent transporter qu'un seul composant à la fois. Ils ne peuvent pas transporter la couleur de l'autre équipe : seulement la couleur de leur équipe et les pièces rouges.",
    "rule6":"Pièces rouges : non fonctionnelles",
    "rule7":"Si le composant qui tombe d'un moteur est une pièce rouge, il peut être réparé à la station de réparation. Chaque équipe dispose de trois stations de réparation pouvant transformer les pièces rouges en pièces réparées de leur couleur.",
    "rule8":"Les pièces de rechange au sol peuvent être apportées à la zone des pièces de rechange. Chaque équipe en possède une.",
    "rule9":"Pointage...",
    "rule10":"1 composant de votre couleur donne 50 points, 2 donnent 100 points et 3 donnent 250 points.",
    "rule11":"Multiplicateurs...",
    "rule12":"La pile la plus haute des deux équipes dans leur zone de pièces de rechange apporte un multiplicateur de 60 %.",
    "rule13":"L'équipe ayant le plus de pièces dans sa zone de pièces de rechange obtient un multiplicateur de 40 %.",
    "rule14":"Une équipe peut obtenir les deux bonus.",
    "rule15":"Chaque réparation rapporte 30 points.",
    "rule16":"Chaque composant dans la zone de pièces de rechange vaut 40 points.",
    "rule17":"Fin.",

    "toggle_full":"Basculer Plein Écran",
    "toggle_scan":"Lignes de Balayage",

    "visit_source":"Visiter la source",
    "credit1":"Image du dossier",
    "credit2":"Effet de glitch",
    "credit3":"Logo du Batcomputer",
    "credit4":"Fond d'écran HUD du Batcomputer",
    "credit5":"Lignes de balayage",
    "credit6":"Effet de glitch de transition",
    "credit7":"Effet de bande dessinée",
    "credit8":"Images de bande dessinée Batman",

    "about_crc":"C'est quoi CRC Robotique?",
    "about_crctext":"CRC Roboticque est un organisme à but non lucratif fondé en 2001 qui a réussi à établir un moyen de relier l'ingénierie, la programmation, l'art, les mathématiques et bien plus encore en une seule compétition. Ces dernières années, une division junior a également été ajoutée, rendant la robotique plus accessible aux plus jeunes participants.",
    "beyond_competition":"Au-delà de la compétition",
    "beyond_competitiontext":"Au-delà de l'aspect compétitif, CRC met fortement l'accent sur l'amélioration du travail d'équipe des participants, la création de liens significatifs et la mise à disposition des ressources nécessaires au développement de leurs connaissances en STIM.",
    "crc_more":"Pour en savoir plus sur la compétition, vous pouvez visiter leur",

    "conception_title1":"Système de convoyeur de pièces de jeu",
    "conception_title2":"Électronique",
    "conception_title3":"Élévateur à pince / Élévateur d'empilement de pièces de jeu",
    "conception_title4":"Système d'entraînement",
    "conception1":"Le système de convoyeur de pièces de jeu est composé de 3 niveaux distincts pour chaque taille de GP. Les proportions et l'alignement sont précisément conçus pour correspondre à l'entrée des moteurs, assurant une facilité et une efficacité extrêmes pendant le jeu. Chaque système de convoyeur canalise les pièces de jeu depuis le terrain, telles qu'elles se présentent, vers le canal souhaité correspondant au moteur, permettant une manipulation simple et sans effort des GP et des moteurs ensemble lors de leur éjection par l'arrière du robot. Le système de chaîne (pignons, chaîne, séparateurs) ainsi que les supports de roulements sont entièrement conçus sur mesure.",
    "conception2":"Toute l'électronique est solidement montée sur le châssis supérieur du robot, répartie pour un accès facile et une efficacité optimale, tout en offrant une accessibilité claire à l'interrupteur d'arrêt d'urgence et au Crcduino. La batterie est placée à l'avant du châssis du robot afin de contrebalancer les composants — tels que la configuration à 3 moteurs pour les convoyeurs distincts — et d'équilibrer le côté du robot où l'empattement est légèrement raccourci pour améliorer la maniabilité au-dessus des moteurs.",
    "conception3":"L'élévateur à pince et le mécanisme de rotation sont placés à l'avant du robot à une position précise afin de saisir la GP « core » via notre système de convoyeur, maximisant le potentiel d'empilement (puisque le « core » est la GP plaçable verticalement la plus haute), le mécanisme agissant également comme contrepoids. Le mécanisme est composé de 2 grandes poulies/chaînes, positionnées pour offrir un moment d'inertie maximal et ainsi augmenter le couple ; cela permet de faire pivoter la pince avec une grande précision tout en étant capable de transporter les pièces de jeu les plus lourdes.",
    "conception4":"Le système d'entraînement est à propulsion arrière (RWD) et se compose de 8 roues distinctes. Les 4 roues avant (2 de chaque côté en configuration sandwich) sont montées sur 2 roulements et solidement renforcées par du métal Vex ; un pignon est connecté entre les deux roues fines mais résistantes pour une transmission par chaîne fluide et continue. Les 4 roues arrière libres (2 de chaque côté en configuration sandwich) sont indépendantes les unes des autres malgré leur présence sur le même axe grâce à des roulements spécialement positionnés, rendant les virages extrêmement fluides même avec seulement 2 roues motrices sur 4. Le système est propulsé par deux moteurs GoBilda de 117 tr/min, offrant un équilibre entre vitesse et couple. Dans son ensemble, le système d'entraînement possède une empreinte très réduite, conférant au robot un avantage d'élite lors du jeu sur les moteurs."
}